# Olympic Data

## Setup

In [1]:
# Import dependencies
import pandas as pd
from sqlalchemy import create_engine
from config import password

## Import csvs into dataframes

In [2]:
# Import csvs into data frames
athlete = pd.read_csv('Resources/Raw/athlete_events_raw.csv')
regions = pd.read_csv('Resources/Raw/noc_regions_raw.csv')
summer = pd.read_csv('Resources/Raw/summer_raw.csv')
winter = pd.read_csv('Resources/Raw/winter_raw.csv')
wdi = pd.read_csv('Resources/Raw/WDIData_raw.csv')

## Print heads of tables

In [3]:
athlete.head()

### PLAN FOR THIS TABLE ###
# - Drop Games column
# - Split names column into first and last.

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [4]:
regions.head()

### PLAN FOR THIS TABLE ###
# - Drop notes column
# - Add country code column.

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [5]:
summer.head()

### PLAN FOR THIS TABLE ###
# - Split the athlete column into first and last name columns.

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [6]:
winter.head()

### PLAN FOR THIS TABLE ###
# - Split the athlete column into first and last name columns (same as for the summer table).

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze
2,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, Maurice",FRA,Men,Military Patrol,Bronze
3,1924,Chamonix,Biathlon,Biathlon,"VANDELLE, André",FRA,Men,Military Patrol,Bronze
4,1924,Chamonix,Biathlon,Biathlon,"AUFDENBLATTEN, Adolf",SUI,Men,Military Patrol,Gold

## Athletes Table

In [7]:
# Drop games column
athlete.drop('Games', axis=1, inplace=True)

In [8]:
# Add a last name column which is empty to start
athlete['last_name'] = ''

# Rename column headers to be lowercased
athlete.columns = ['id', 'name', 'sex', 'age', 'height', 'weight', 'team', 'noc', 'year', 'season', 'city', 'sport', 'event', 'medal', 'last_name']

In [9]:
# Split the Name column into Last Name and First Name

list_split_names = [str(name).split() for name in athlete["name"]]
last_name_list = [a.pop(-1) for a in list_split_names]
first_name_list = [' '.join(item) for item in list_split_names]

# Reassign the columns in the dataframe

athlete['name'] = first_name_list
athlete['last_name'] = last_name_list

In [10]:
athlete = athlete[['id', 'last_name', 'name', 'sex', 'age', 'height', 'weight', 'team', 'noc', 'year', 'season', 'city', 'sport', 'event', 'medal']]

In [11]:
# Rename some columns
athlete.rename(columns={'name':'first_name', 'id': 'athlete_id'}, inplace=True)

In [12]:
# Add an id column for primary key
athlete['id'] = [x + 1 for x in range(len(athlete['athlete_id']))]

In [13]:
# Reorder columns so 'id' column is first
athlete = athlete[['id', 'athlete_id', 'last_name', 'first_name', 'sex', 'age', 'height', 'weight', 'team', 'noc', 'year', 'season', 'city', 'sport', 'event', 'medal']]

In [14]:
athlete.head(10)

,id,athlete_id,last_name,first_name,sex,age,height,weight,team,noc,year,season,city,sport,event,medal
0,1,1,Dijiang,A,M,24.0,180.0,80.0,China,CHN,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,2,Lamusi,A,M,23.0,170.0,60.0,China,CHN,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,3,Aaby,Gunnar Nielsen,M,24.0,NaN,NaN,Denmark,DEN,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,4,Aabye,Edgar Lindenau,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,5,Aaftink,Christine Jacoba,F,21.0,185.0,82.0,Netherlands,NED,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,6,5,Aaftink,Christine Jacoba,F,21.0,185.0,82.0,Netherlands,NED,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,7,5,Aaftink,Christine Jacoba,F,25.0,185.0,82.0,Netherlands,NED,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,8,5,Aaftink,Christine Jacoba,F,25.0,185.0,82.0,Netherlands,NED,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,9,5,Aaftink,Christine Jacoba,F,27.0,185.0,82.0,Netherlands,NED,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,10,5,Aaftink,Christine Jacoba,F,27.0,185.0,82.0,Netherlands,NED,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN

## Regions Table

In [15]:
# Drop notes column
regions.drop('notes', axis=1, inplace=True)

In [16]:
regions.head()

   NOC       region
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [17]:
# Rename NOC column to be lower case
regions.rename(columns = {'NOC': 'noc', 'region': 'name'}, inplace=True)

In [18]:
regions.head()

   noc         name
0  AFG  Afghanistan
1  AHO      Curacao
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [19]:
# Pull just the two columns I want from the wdi table
wdi = wdi[['Country Name', 'Country Code']]

In [20]:
# Rename the columns and drop duplicate rows
wdi.columns = ['name', 'country_code']
wdi = wdi.drop_duplicates()

In [21]:
# Join the trimmed wdi dataframe with regions dataframe on the name column. Call this the new regions dataframe.
regions = pd.merge(wdi, regions, how='outer', on='name')

# Reorder the columns
regions = regions[['noc', 'country_code', 'name']]
regions.columns = ['noc', 'country_code', 'country_name']
regions.head()

   noc country_code                    country_name
0  NaN          ARB                      Arab World
1  NaN          CSS          Caribbean small states
2  NaN          CEB  Central Europe and the Baltics
3  NaN          EAR      Early-demographic dividend
4  NaN          EAS             East Asia & Pacific

In [22]:
# Find the list of duplicated rows - will be helpful for code to come.
regions[regions.duplicated(subset='country_name')]

     noc country_code    country_name
58   AUS          AUS       Australia
84   NFL          CAN          Canada
91   HKG          CHN           China
103  CZE          CZE  Czech Republic
104  TCH          CZE  Czech Republic
126  GDR          DEU         Germany
127  GER          DEU         Germany
128  SAA          DEU         Germany
132  GRE          GRC          Greece
177  MAS          MYS        Malaysia
178  NBO          MYS        Malaysia
227  SRB          SRB          Serbia
228  YUG          SRB          Serbia
272  VNM          VNM         Vietnam
278  ZIM          ZWE        Zimbabwe
290  RUS          NaN          Russia
291  URS          NaN          Russia
307  TUV          NaN             NaN
308  UNK          NaN             NaN
313  UAR          NaN           Syria
316  WIF          NaN        Trinidad
321  YEM          NaN           Yemen
322  YMD          NaN           Yemen

In [23]:
# Create list of country names that are duplicated
dups = regions[regions.duplicated(subset='country_name')]['country_name'].unique().tolist()

In [24]:
# List of **all** rows based on duplicated country names
dup_slice = regions[regions['country_name'].isin(dups)]

In [25]:
# Add 3 more noc columns to regions dataframe to handle duplicate cases. 
# Rename them to be noc_1, noc_2, noc_3, and noc_4.

regions['noc_2'] = ''
regions['noc_3'] = ''
regions['noc_4'] = ''
regions = regions.rename(columns={'noc': 'noc_1'})

In [26]:
# Reorder columns so noc ones are at the front
regions = regions[['noc_1', 'noc_2', 'noc_3', 'noc_4', 'country_code', 'country_name']]
regions.head()

  noc_1 noc_2 noc_3 noc_4 country_code                    country_name
0   NaN                            ARB                      Arab World
1   NaN                            CSS          Caribbean small states
2   NaN                            CEB  Central Europe and the Baltics
3   NaN                            EAR      Early-demographic dividend
4   NaN                            EAS             East Asia & Pacific

In [27]:
# Write for loop to populate the noc_i's.
for country in dups:
    dup_slice = regions[regions['country_name']==country]
    index_list = dup_slice.index.values.tolist() # Outputs list of indices, note that this list will have 2 or more elements
    
    if len(index_list) == 2:
        regions.iloc[index_list[0], 1] = regions.iloc[index_list[1], 0]
    
    elif len(index_list) == 3:
        regions.iloc[index_list[0], 1] = regions.iloc[index_list[1], 0]
        regions.iloc[index_list[0], 2] = regions.iloc[index_list[2], 0]
    
    elif len(index_list) == 4:
        regions.iloc[index_list[0], 1] = regions.iloc[index_list[1], 0]
        regions.iloc[index_list[0], 2] = regions.iloc[index_list[2], 0]
        regions.iloc[index_list[0], 3] = regions.iloc[index_list[3], 0]

In [28]:
# Show duplicated rows again to confirm the above for loop worked correctly
dup_slice = regions[regions['country_name'].isin(dups)]
dup_slice

    noc_1 noc_2 noc_3 noc_4 country_code    country_name
57    ANZ   AUS                      AUS       Australia
58    AUS                            AUS       Australia
83    CAN   NFL                      CAN          Canada
84    NFL                            CAN          Canada
90    CHN   HKG                      CHN           China
91    HKG                            CHN           China
102   BOH   CZE   TCH                CZE  Czech Republic
103   CZE                            CZE  Czech Republic
104   TCH                            CZE  Czech Republic
125   FRG   GDR   GER   SAA          DEU         Germany
126   GDR                            DEU         Germany
127   GER                            DEU         Germany
128   SAA                            DEU         Germany
131   CRT   GRE                      GRC          Greece
132   GRE                            GRC          Greece
176   MAL   MAS   NBO                MYS        Malaysia
177   MAS                            MYS        Malaysia
178   NBO                            MYS        Malaysia
226   SCG   SRB   YUG                SRB          Serbia
227   SRB                            SRB          Serbia
228   YUG                            SRB          Serbia
271   VIE   VNM                      VNM         Vietnam
272   VNM                            VNM         Vietnam
277   RHO   ZIM                      ZWE        Zimbabwe
278   ZIM                            ZWE        Zimbabwe
289   EUN   RUS   URS                NaN          Russia
290   RUS                            NaN          Russia
291   URS                            NaN          Russia
306   ROT                            NaN             NaN
307   TUV                            NaN             NaN
308   UNK                            NaN             NaN
312   SYR   UAR                      NaN           Syria
313   UAR                            NaN           Syria
315   TTO   WIF                      NaN        Trinidad
316   WIF                            NaN        Trinidad
320   YAR   YEM   YMD                NaN           Yemen
321   YEM                            NaN           Yemen
322   YMD                            NaN           Yemen

In [29]:
# Remove duplicated rows now.
list_rows_to_drop = regions[regions.duplicated(subset='country_name')].index.values.tolist()
regions = regions.drop(list_rows_to_drop)

In [30]:
# Now drop rows with NaN value in the column country_name.
regions.dropna(axis=0, subset=['country_name'], inplace=True)

## Summer Table

In [31]:
# Change column names to be in lower case
summer.columns = ['year', 'city', 'sport', 'discipline', 'athlete_name', 'country_code', 'sex', 'event', 'medal']

In [32]:
# Add a new column so we can split names, and reorder the columns
summer['athlete_first_name'] = ''
summer = summer[['year', 'city', 'sport', 'discipline', 'athlete_name', 'athlete_first_name', 'country_code', 'sex', 'event', 'medal']]

In [33]:
# Split the Name column into Last Name and First Name

list_split_names = [str(name).split(',') for name in summer["athlete_name"]]
last_name_list = [a.pop(0) for a in list_split_names]
first_name_list = [' '.join(item) for item in list_split_names]
first_name_list = [item.lstrip() for item in first_name_list]

# Reassign the columns in the dataframe

summer['athlete_name'] = last_name_list
summer['athlete_first_name'] = first_name_list

In [34]:
# Rename the name column to refer to last name
summer.rename(columns = {'athlete_name': 'athlete_last_name'}, inplace=True)

In [35]:
# Add an id column
summer['id'] = [x + 1 for x in range(len(summer['sport']))]

In [36]:
# Reorder columns so 'id' column is first
summer = summer[['id', 'year', 'city', 'sport', 'discipline', 'athlete_last_name', 'athlete_first_name', 'country_code', 'sex', 'event', 'medal']]

In [37]:
summer.head(25)

,id,year,city,sport,discipline,athlete_last_name,athlete_first_name,country_code,sex,event,medal
0,1,1896,Athens,Aquatics,Swimming,HAJOS,Alfred,HUN,Men,100M Freestyle,Gold
1,2,1896,Athens,Aquatics,Swimming,HERSCHMANN,Otto,AUT,Men,100M Freestyle,Silver
2,3,1896,Athens,Aquatics,Swimming,DRIVAS,Dimitrios,GRE,Men,100M Freestyle For Sailors,Bronze
3,4,1896,Athens,Aquatics,Swimming,MALOKINIS,Ioannis,GRE,Men,100M Freestyle For Sailors,Gold
4,5,1896,Athens,Aquatics,Swimming,CHASAPIS,Spiridon,GRE,Men,100M Freestyle For Sailors,Silver
5,6,1896,Athens,Aquatics,Swimming,CHOROPHAS,Efstathios,GRE,Men,1200M Freestyle,Bronze
6,7,1896,Athens,Aquatics,Swimming,HAJOS,Alfred,HUN,Men,1200M Freestyle,Gold
7,8,1896,Athens,Aquatics,Swimming,ANDREOU,Joannis,GRE,Men,1200M Freestyle,Silver
8,9,1896,Athens,Aquatics,Swimming,CHOROPHAS,Efstathios,GRE,Men,400M Freestyle,Bronze
9,10,1896,Athens,Aquatics,Swimming,NEUMANN,Paul,AUT,Men,400M Freestyle,Gold
10,11,1896,Athens,Aquatics,Swimming,PEPANOS,Antonios,GRE,Men,400M Freestyle,Silver
11,12,1896,Athens,Athletics,Athletics,LANE,Francis,USA,Men,100M,Bronze
12,13,1896,Athens,Athletics,Athletics,SZOKOLYI,Alajos,HUN,Men,100M,Bronze
13,14,1896,Athens,Athletics,Athletics,BURKE,Thomas,USA,Men,100M,Gold
14,15,1896,Athens,Athletics,Athletics,HOFMANN,Fritz,GER,Men,100M,Silver
15,16,1896,Athens,Athletics,Athletics,CURTIS,Thomas,USA,Men,110M Hurdles,Gold
16,17,1896,Athens,Athletics,Athletics,GOULDING,Grantley,GBR,Men,110M Hurdles,Silver
17,18,1896,Athens,Athletics,Athletics,LERMUSIAUX,Albin,FRA,Men,1500M,Bronze
18,19,1896,Athens,Athletics,Athletics,FLACK,Edwin,AUS,Men,1500M,Gold
19,20,1896,Athens,Athletics,Athletics,BLAKE,Arthur,USA,Men,1500M,Silver
20,21,1896,Athens,Athletics,Athletics,GMELIN,Charles,GBR,Men,400M,Bronze
21,22,1896,Athens,Athletics,Athletics,BURKE,Thomas,USA,Men,400M,Gold
22,23,1896,Athens,Athletics,Athletics,JAMISON,Herbert,USA,Men,400M,Silver
23,24,1896,Athens,Athletics,Athletics,GOLEMIS,Dimitrios,GRE,Men,800M,Bronze
24,25,1896,Athens,Athletics,Athletics,FLACK,Edwin,AUS,Men,800M,Gold

## Winter Table

In [38]:
# Change column names to be in lower case
winter.columns = ['year', 'city', 'sport', 'discipline', 'athlete_name', 'country_code', 'sex', 'event', 'medal']

In [39]:
# Add a new column so we can split names, and reorder the columns
winter['athlete_first_name'] = ''
winter = winter[['year', 'city', 'sport', 'discipline', 'athlete_name', 'athlete_first_name', 'country_code', 'sex', 'event', 'medal']]

In [40]:
# Split the Name column into Last Name and First Name

list_split_names = [str(name).split(',') for name in winter["athlete_name"]]
last_name_list = [a.pop(0) for a in list_split_names]
first_name_list = [' '.join(item) for item in list_split_names]
first_name_list = [item.lstrip() for item in first_name_list]

# Reassign the columns in the dataframe

winter['athlete_name'] = last_name_list
winter['athlete_first_name'] = first_name_list

In [41]:
# Rename the name column to refer to last name
winter.rename(columns = {'athlete_name': 'athlete_last_name'}, inplace=True)

In [42]:
# Add an id column
winter['id'] = [x + 1 for x in range(len(winter['sport']))]

In [43]:
# Reorder columns so 'id' column is first
winter = winter[['id', 'year', 'city', 'sport', 'discipline', 'athlete_last_name', 'athlete_first_name', 'country_code', 'sex', 'event', 'medal']]

In [44]:
winter.head()

,id,year,city,sport,discipline,athlete_last_name,athlete_first_name,country_code,sex,event,medal
0,1,1924,Chamonix,Biathlon,Biathlon,BERTHET,G.,FRA,Men,Military Patrol,Bronze
1,2,1924,Chamonix,Biathlon,Biathlon,MANDRILLON,C.,FRA,Men,Military Patrol,Bronze
2,3,1924,Chamonix,Biathlon,Biathlon,MANDRILLON,Maurice,FRA,Men,Military Patrol,Bronze
3,4,1924,Chamonix,Biathlon,Biathlon,VANDELLE,André,FRA,Men,Military Patrol,Bronze
4,5,1924,Chamonix,Biathlon,Biathlon,AUFDENBLATTEN,Adolf,SUI,Men,Military Patrol,Gold

## Connect and Load into Database

In [45]:
# Create connection
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/olympic_data')

# Confirm table
engine.table_names()

['summer', 'soccer', 'winter', 'regions', 'athlete', 'country']

In [46]:
# Load dataframes to database
athlete.to_sql(name='athlete', con=engine, if_exists='append', index=False)
regions.to_sql(name='regions', con=engine, if_exists='append', index=False)
summer.to_sql(name='summer', con=engine, if_exists='append', index=False)
winter.to_sql(name='winter', con=engine, if_exists='append', index=False)

In [47]:
# Confirm data has been loaded from athlete
pd.read_sql_query('SELECT * FROM athlete', con=engine).head()

,id,athlete_id,last_name,first_name,sex,age,height,weight,team,noc,year,season,city,sport,event,medal
0,1,1,Dijiang,A,M,24.0,180.0,80.0,China,CHN,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,None
1,2,2,Lamusi,A,M,23.0,170.0,60.0,China,CHN,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,None
2,3,3,Aaby,Gunnar Nielsen,M,24.0,NaN,NaN,Denmark,DEN,1920,Summer,Antwerpen,Football,Football Men's Football,None
3,4,4,Aabye,Edgar Lindenau,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,5,Aaftink,Christine Jacoba,F,21.0,185.0,82.0,Netherlands,NED,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,None

In [48]:
# Confirm data has been loaded from regions
pd.read_sql_query('SELECT * FROM regions', con=engine).head()

  noc_1 noc_2 noc_3 noc_4 country_code                    country_name
0  None                            ARB                      Arab World
1  None                            CSS          Caribbean small states
2  None                            CEB  Central Europe and the Baltics
3  None                            EAR      Early-demographic dividend
4  None                            EAS             East Asia & Pacific

In [49]:
# Confirm data has been loaded from summer
pd.read_sql_query('SELECT * FROM summer', con=engine).head()

,id,year,city,sport,discipline,athlete_last_name,athlete_first_name,country_code,sex,event,medal
0,1,1896,Athens,Aquatics,Swimming,HAJOS,Alfred,HUN,Men,100M Freestyle,Gold
1,2,1896,Athens,Aquatics,Swimming,HERSCHMANN,Otto,AUT,Men,100M Freestyle,Silver
2,3,1896,Athens,Aquatics,Swimming,DRIVAS,Dimitrios,GRE,Men,100M Freestyle For Sailors,Bronze
3,4,1896,Athens,Aquatics,Swimming,MALOKINIS,Ioannis,GRE,Men,100M Freestyle For Sailors,Gold
4,5,1896,Athens,Aquatics,Swimming,CHASAPIS,Spiridon,GRE,Men,100M Freestyle For Sailors,Silver

In [50]:
# Confirm data has been loaded from winter
pd.read_sql_query('SELECT * FROM winter', con=engine).head()

,id,year,city,sport,discipline,athlete_last_name,athlete_first_name,country_code,sex,event,medal
0,1,1924,Chamonix,Biathlon,Biathlon,BERTHET,G.,FRA,Men,Military Patrol,Bronze
1,2,1924,Chamonix,Biathlon,Biathlon,MANDRILLON,C.,FRA,Men,Military Patrol,Bronze
2,3,1924,Chamonix,Biathlon,Biathlon,MANDRILLON,Maurice,FRA,Men,Military Patrol,Bronze
3,4,1924,Chamonix,Biathlon,Biathlon,VANDELLE,André,FRA,Men,Military Patrol,Bronze
4,5,1924,Chamonix,Biathlon,Biathlon,AUFDENBLATTEN,Adolf,SUI,Men,Military Patrol,Gold

## Export to CSV

In [51]:
athlete.to_csv('Resources/athlete.csv', index=False)
regions.to_csv('Resources/regions.csv', index=False)
summer.to_csv('Resources/summer.csv', index=False)
winter.to_csv('Resources/winter.csv', index=False)